
-- создал пользователя
mysql> CREATE USER 'shop_read'@'localhost' IDENTIFIED BY 'pass';
Query OK, 0 rows affected (0.04 sec)

-- и разрешил ему только читать таблицу shop
mysql> GRANT SELECT ON shop.* TO 'shop_read'@'localhost';
Query OK, 0 rows affected (0.07 sec);


-- проверил что можно читать
mysql> SELECT * FROM users;
+----+------------+-----------+---------------------+---------------------+
| id | first_name | last_name | created_at          | updated_at          |
+----+------------+-----------+---------------------+---------------------+
|  1 | Михаил     | Куратов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  2 | Кирил      | Гончаров  | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  3 | Владимер   | Юранев    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  4 | Игорь      | Попов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  5 | Антон      | Селиванов | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  6 | Влад       | Томов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  7 | Паша       | Морозов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  8 | Алена      | Торлопова | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  9 | Дима       | Исаков    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
+----+------------+-----------+---------------------+---------------------+
9 rows in set (0.00 sec)


-- проверим на внесение данных
mysql> ALTER TABLE users ADD COLUMN passport VARCHAR(100);
ERROR 1142 (42000): ALTER command denied to user 'shop_read'@'localhost' for table 'users'

-- создал пользователя
mysql> CREATE USER 'shop'@'localhost' IDENTIFIED BY '000';
Query OK, 0 rows affected (0.05 sec)

-- и предоставил разрешение на все действия только таблицы shop
mysql> GRANT ALL ON shop.* TO 'shop'@'localhost';
Query OK, 0 rows affected (0.04 sec)

mysql> GRANT GRANT OPTION ON shop.* TO 'shop'@'localhost';
Query OK, 0 rows affected (0.06 sec)

-- проверяем на чтение
SELECT * FROM users;
+----+------------+-----------+---------------------+---------------------+
| id | first_name | last_name | created_at          | updated_at          |
+----+------------+-----------+---------------------+---------------------+
|  1 | Михаил     | Куратов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  2 | Кирил      | Гончаров  | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  3 | Владимер   | Юранев    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  4 | Игорь      | Попов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  5 | Антон      | Селиванов | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  6 | Влад       | Томов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  7 | Паша       | Морозов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  8 | Алена      | Торлопова | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  9 | Дима       | Исаков    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
+----+------------+-----------+---------------------+---------------------+
9 rows in set (0.00 sec)

-- проверяем на запись
mysql> INSERT INTO users (first_name,last_name) VALUES
    -> ('Дамир','Тайгузин');
Query OK, 1 row affected (0.04 sec)

mysql> SELECT * FROM users;
+----+------------+-----------+---------------------+---------------------+
| id | first_name | last_name | created_at          | updated_at          |
+----+------------+-----------+---------------------+---------------------+
|  1 | Михаил     | Куратов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  2 | Кирил      | Гончаров  | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  3 | Владимер   | Юранев    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  4 | Игорь      | Попов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  5 | Антон      | Селиванов | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  6 | Влад       | Томов     | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  7 | Паша       | Морозов   | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  8 | Алена      | Торлопова | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
|  9 | Дима       | Исаков    | 2021-09-13 11:34:51 | 2021-09-13 11:34:51 |
| 10 | Дамир      | Тайгузин  | 2021-09-13 12:16:53 | 2021-09-13 12:16:53 |
+----+------------+---------
--+---------------------+---------------------+
10 rows in set (0.00 sec)
